{"data":{"allMarkdownRemark":{"totalCount":1,"edges":[{"node":{"id":"4e0c13d6-c6fe-5d1a-9ba5-68cc9dfd266a","frontmatter":{"title":"Thoughts on working remotely","date":"14 April, 2019"},"excerpt":"Last year, after working for ten years as a web developer in London, I decided to finally try the whole digital nomad thing.  It'd been a…","html":"<p>Last year, after working for ten years as a web developer in London, I decided to finally try the whole digital nomad thing.  It'd been a long time coming.  One of my motivations to get into programming in the first place was to have a job that wasn't bound by location.  I'd long had a dream of working from a beach hut in the day, perhaps a quick spearfish session at lunch or a nap under a palm tree, something akin to Lister's dreams of Fiji.  However, this never really materialised, or let's just say it got put on hold.</p>\n<p>What I'm trying to say is there wasn't any great driver to finally take the plunge and go remote.  If anything I was more than content with my life in London.  I had good friends, more hobbies than I had time for, a beautiful run commute to work through Regent's Park and Primrose Hill and a great work environment with free lunches, a pool table and most excellent co-workers.  Maybe that's how it is sometimes, we expect big events to be the catalyst for change, but sometimes it's just scratching an itch.</p>\n<p>Anyway, let's get into the practicalities.  After making the decision, and more importantly announcing it to friends and family, I was now committed.  Now came the storm before the calm.  </p>\n<h2>Preparation</h2>\n<ul>\n<li>Do you research.  If you are not native to the country you will be going to, read as much as you can about the place.  Knowing the basics of the geography, culture and weather will help you make better decisions. Don't be afraid to ask questions on online forums, there is a wealth of information available.  Learn from other's mistakes not your own.</li>\n<li>Flights.  Flight comparison sites such as Google Flights and Skyscanner make this a relatively straightforward task.  It's worth searching a week before and after your intended departure date to see if there are any price drops.</li>\n<li>Stuff.  Any illusions of being a minimalist quikly evapourated when I had to fit everything I owned into a storage unit.  It took longer than I thought to pack up my flat and I wish I had started sooner.  Small tip - I got an UberXL to take the 4-5 boxes I had to the storage depot for a fraction of the price of a van.</li>\n<li>Visas.  Check the visa requirements for the country or countries you are going to.  Give yourself enough time to deal with the bureaucracy. </li>\n<li>Shots.  Tell your doctor about your travel plans so that you get any required immunisations.  Don't leave this until the last minute as some shots require a week or so to offer full protection.</li>\n<li>Banking.  At the very least take a debit and a credit card.  Ideally take two or more debit cards.  Why?  If you only take one debit card and lose it, you might have to withdraw cash from ATMs with a credit card and pay dearly with interest.  From my experience I would recommend <a href=\"https://monzo.com/\">Monzo</a> and <a href=\"https://transferwise.com/\">Transferwise</a>.</li>\n<li>\n<p>What to pack.  This is always going to differ person-to-person and by location.  Some items I found useful:</p>\n<ul>\n<li>Fabric compartments to help organise your suitcase.</li>\n<li>Swimwear, googles, snorkel and mask  </li>\n<li>Multitool.  Not all AirBnbs/hotels provide adequate knives, bottle openers etc.</li>\n<li>Sun lotion.  This is an item that always seems to have a big markup when buying on location, so buy in bulk at home to save a few pennies</li>\n<li>Waterproofs.  A mac and something to keep your phone/wallet dry.</li>\n<li>Footwear.  If your shoes resemble canoes like me, choose your footwear wisely as they will likely be the biggest space stealers in your suitcase.</li>\n<li>Noise cancelling headphones and earplugs</li>\n<li>Sunglasses</li>\n<li>Portable speaker</li>\n<li>Powerbank</li>\n<li>(Optional) Coffee making facilities.  I use an Aeropress, it is officially the best thing ever.</li>\n<li>(Optional) Action camera.  This one is debatable.  I took a GoPro, I've only used it a handful of times, but the moments it has allowed me to capture have been pretty special.  So overall I feel it was worth the expense, but I appreciate not all might necessarily agree.</li>\n</ul>\n</li>\n<li>Driving licence.  If you have a licence check out the requirements for foreign drivers for your target country/countries.  Chances are a simple International Permit, commonly available in the UK from the Post Office for a small fee, will allow you to drive in your destination.</li>\n<li>Get a VPN.  Protect your data while using airport and public wifi.</li>\n<li>Travel insurance.  Make sure you're covered for a lost/stolen laptop.  More importantly make sure you're covered for healthcare costs if good times go bad.</li>\n</ul>\n<h2>Life on the other side</h2>\n<p>My first month of travel took me to Borneo, Kuala Lumpar, Cebu, Taiwan and Phuket.  Although this looked great on paper, by the end of it I realised I was passing through places too quickly to appreciate them and needed to slow down.  Some thoughts here in no particular order</p>\n<ul>\n<li>Book ahead.  If you know your itinerary this will give you a wider choice of accomocation for a better price.  It will also free you of the task when you are at your location.  It can be very frustrating to be forced to give up a morning/evening in a new exciting place scanning the accomocation booking sites for your next lodgings.</li>\n</ul>\n<h3>Location, location, location</h3>\n<p>Consider where you will work from.  For me these options tended to boil down to</p>\n<ul>\n<li>\n<p>My accomodation.</p>\n<ul>\n<li>Pros. No commute, cooking is an option if local food options are poor or over-priced</li>\n<li>Cons. You're working in the place you sleep, isolated</li>\n</ul>\n</li>\n<li>\n<p>Coffeeshops/restaurants</p>\n<ul>\n<li>Pros. A happy-medium between working from your room and a co-working space.  Low cost.</li>\n<li>Cons. Potentially dodgy WiFi, can be noisy, some places won't take kindly to customers sitting their for hours and will want you drink up and leave.  This is rarely said, but the body language is unmistakeable.</li>\n</ul>\n</li>\n<li>\n<p>Co-working spaces.</p>\n<ul>\n<li>Pros.  Solid internet connection/WiFi, no anxiety about overstaying your welcome, less disturbance than a coffee shop.  A chance to communicate with similar individuals.  Feels more like an office (this could either be a pro or a con dependending on your feelings).  Better security.</li>\n<li>Cons.  Cost, commute.</li>\n</ul>\n</li>\n</ul>\n<p>I ended up using a combination of the above.  Sometimes I'd work the morning in a coffee shop, grab lunch out and then return to work the afternoon from my AitBnb.  Othertimes I'd join a co-working space for a week or so and work out of there.  Give it a try and see what works for you.</p>\n<h3>It's on you</h3>\n<p>Being a digital nomad is great because it gives you great freedom over your circumstances, however as we all know <a href=\"https://youtu.be/tzW2ybYFboQ\">freedom isn't free</a>.  One of the big wake up calls of this endevaour was to realise how much my life was on auto-pilot back in London.  I barely had to think about anything.  Acommodation was sorted, food shopping had become an unconcious operation, social events just bubbled up from friends with little to any effort from me.  When I hit the tarmac in Kuala Lumpar, it quickly became apparent that was not a holiday, it was survival.  Suddenly I was faced with a torrent of questions that need answers.  Some examples:</p>\n<ul>\n<li>Where are you sleeping tonight?</li>\n<li>Where are you going to be next week?  Where are you staying?  What's your budget?</li>\n<li>Have you booked your flight to the next destination?  Ok, great.  How about the outward flight?  Most airlines won't let you board a flight unless you have an outward flight.  There goes the \"yah cool man, let's just play it by ear\" approach, at least to some extent</li>\n<li>Have you checked the visa and immunisations required for the next country? No, of course you haven't, better do that now</li>\n</ul>\n<h3>Work/Life Balance</h3>\n<p>Freeing yourself from the distractions of the office brings it's own set of challenges.  In an atmosphoere of little to no interruptions, if you don't actively manage your time to make sure you take regular breaks then you risk burnout.  As ever, there are apps for this, one example being <a href=\"https://hovancik.net/stretchly/\">Stretchly</a>.</p>"}}]}},"pageContext":{"isCreatedByStatefulCreatePages":true}}