{"data":{"allMarkdownRemark":{"totalCount":1,"edges":[{"node":{"id":"4e0c13d6-c6fe-5d1a-9ba5-68cc9dfd266a","frontmatter":{"title":"Thoughts on working remotely","date":"14 April, 2019"},"excerpt":"Last year, after working for ten years as a web developer in London, I decided to finally try the whole digital nomad thing.  It'd been a…","html":"<p>Last year, after working for ten years as a web developer in London, I decided to finally try the whole digital nomad thing.  It'd been a long time coming.  One of my motivations to get into programming in the first place was to have a job that wasn't bound by location.  I'd long had a dream of working from a beach hut in the day, perhaps a quick spearfish session at lunch or a nap under a palm tree, something akin to Lister's dreams of Fiji.  However, this never really materialised, or let's just say it got put on hold.</p>\n<p>What I'm trying to say is there wasn't any great driver to finally take the plunge and go remote.  If anything I was more than content with my life in London.  I had good friends, more hobbies than I had time for, a beautiful run commute to work through Regent's Park and Primrose Hill and a great work environment with free lunches, a pool table and most excellent co-workers.  Maybe that's how it is sometimes, we expect big events to be the catalyst for change, but sometimes it's just scratching an itch.</p>\n<p>Anyway, let's get into the practicalities.  After making the decision, and more importantly announcing it to friends and family, I was now committed.  Now came the storm before the calm.  </p>\n<h2>Preperation</h2>\n<ul>\n<li>Flights.  Google Flights and Skyscanner were really useful here.  Worth search a week before and after your intended departure date to see if there are any price drops.</li>\n<li>My things.  Any illusions of being a minimalist quikly evapourated when I had to fit everything I owned into a storage unit.  It took longer than I thought to pack up my flat and I wish I had started sooner.  Small tip - I got an UberXL to take the 4-5 boxes I had to the storage depot for a fraction of the price of a van.</li>\n</ul>\n<h2>Life on the other side</h2>"}}]}},"pageContext":{"isCreatedByStatefulCreatePages":true}}